[{
  "_id": {
    "$oid": "6603e64e95cb446ba7e0c42a"
  },
  "id_1": 2,
  "class_name_1": "Amaranthus Viridis",
  "local_name_1": "Arive Dantu",
  "med_info_1": "Arive Dantu, commonly known as slender amaranth or green amaranth, is a leafy vegetable native to India, but also found in various parts of the world. This plant is esteemed for its high nutritional content, boasting an abundance of essential vitamins, minerals, and antioxidants. Its medicinal applications are diverse, with traditional use primarily focusing on its diuretic properties, aiding in the elimination of excess fluids and toxins from the body.Moreover, Arive Dantu is utilized in traditional medicine to regulate blood pressure and alleviate conditions like urinary tract infections and kidney stones. The leaves, often consumed cooked or raw, are versatile in culinary preparations, finding their way into salads, soups, or stir-fries. Beyond its nutritional and medicinal value, Arive Dantu also holds cultural significance in various cuisines, where its earthy flavor and tender texture contribute to a myriad of dishes. This plant's broad utility, both in health and gastronomy, underscores its importance as a staple in diets and traditional medicine practices across different regions.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603e64e95cb446ba7e0c42b"
  },
  "id_1": 3,
  "class_name_1": "Artocarpus Heterophyllus",
  "local_name_1": "Jackfruit",
  "med_info_1": "Jackfruit, scientifically known as Artocarpus heterophyllus, is a tropical tree fruit indigenous to the Indian subcontinent and Southeast Asia. Revered for its immense size, distinctive sweet flavor, and versatile culinary applications, jackfruit serves as a staple food and a significant cultural symbol in many tropical regions.Beyond its culinary appeal, jackfruit possesses notable medicinal properties that have been recognized in traditional medicine systems for centuries. Rich in dietary fiber, vitamins, and minerals, jackfruit contributes to digestive health, aids in weight management, and supports overall well-being. Additionally, jackfruit contains phytochemicals such as flavonoids and phenolics, which exhibit antioxidant and anti-inflammatory properties, potentially reducing the risk of chronic diseases and promoting cardiovascular health.Various parts of the jackfruit tree, including the leaves, roots, and seeds, are utilized in traditional herbal remedies to address a range of ailments. For instance, extracts from the leaves and roots are known for their antimicrobial properties, used to treat skin infections and wounds. Jackfruit seeds are also valued for their medicinal potential, containing compounds that may help regulate blood sugar levels and support liver health.Furthermore, jackfruit has garnered attention for its sustainability and potential role in addressing food security challenges. As a high-yielding crop with minimal input requirements, jackfruit offers a viable solution for combating hunger and malnutrition in resource-limited regions. Its adaptability to diverse agroecological conditions and ability to thrive in marginal lands further underscore its significance as a sustainable food source.In summary, jackfruit stands as a remarkable fruit with multifaceted benefits, encompassing culinary, medicinal, and socioeconomic dimensions. Its cultivation and utilization not only contribute to nutritional security but also offer opportunities for sustainable agriculture and economic development in tropical regions globally.",
  "location_found_1": "Indian subcontinent and Southeast Asia"
},
{
  "_id": {
    "$oid": "6603e64e95cb446ba7e0c42c"
  },
  "id_1": 4,
  "class_name_1": "Azadirachta Indica",
  "local_name_1": "Neem",
  "med_info_1": "Neem scientifically known as Azadirachta indica is a versatile medicinal plant native to the Indian subcontinent including India. It has been extensively used in Ayurvedic medicine for thousands of years due to its numerous health benefits. Neem is valued for its antibacterial antifungal antiviral and anti-inflammatory properties. The various parts of the neem tree including the leaves bark oil and seeds are utilized in traditional medicine for treating a wide range of ailments. Neem leaves in particular are renowned for their effectiveness in treating skin disorders such as acne eczema and psoriasis. They possess potent antibacterial properties which help in combating acne-causing bacteria and reducing inflammation. Neem oil extracted from the seeds is often used topically to moisturize the skin soothe irritation and promote wound healing. Moreover neem is recognized for its oral health benefits. It is commonly used in oral hygiene products such as toothpaste and mouthwash due to its ability to combat dental issues like plaque gingivitis and gum disease. The antibacterial properties of neem help in killing harmful bacteria in the mouth and maintaining overall oral hygiene. Additionally neem has been studied for its potential in the management of various systemic conditions. Research suggests that",
  "location_found_1": " Indian subcontinent, including India"
},
{
  "_id": {
    "$oid": "6603e64e95cb446ba7e0c42d"
  },
  "id_1": 5,
  "class_name_1": "Basella Alba",
  "local_name_1": "Basale",
  "med_info_1": "Basale scientifically known as Basella alba is a leafy green vegetable native to tropical Asia including regions of India. Highly esteemed for its nutritional richness Basale is an excellent source of essential vitamins minerals and antioxidants. In traditional medicine Basale is valued for its cooling properties and is utilized to alleviate heat-related conditions such as fever and inflammation. The leaves of Basale are typically consumed cooked and are incorporated into a variety of culinary dishes including soups curries and stir-fries. Beyond its culinary uses Basale holds medicinal significance. It is believed to possess laxative effects promoting digestive health and alleviating constipation. Moreover Basale is rich in dietary fiber which aids in digestion and helps maintain gastrointestinal health. The presence of vitamins A and C in Basale contributes to its antioxidant properties which may protect against oxidative stress and reduce the risk of chronic diseases such as heart disease and cancer. In traditional medicine systems like Ayurveda Basale is considered a valuable addition to the diet for its ability to balance doshas body energies and promote overall well-being. Its versatility in culinary applications and medicinal properties make Basale a cherished vegetable in Indian cuisine and traditional medicine practices.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603e64e95cb446ba7e0c42e"
  },
  "id_1": 6,
  "class_name_1": "Brassica Juncea",
  "local_name_1": "Indian Mustard",
  "med_info_1": "Indian Mustard scientifically known as Brassica juncea is a cruciferous vegetable widely cultivated in India for its seeds leaves and oil. This versatile plant is renowned for its culinary and medicinal properties making it an integral part of Indian cuisine and traditional medicine systems. Rich in nutrients and bioactive compounds Indian Mustard offers a myriad of health benefits. The seeds contain glucosinolates sulfur-containing compounds known for their antioxidant and anti-inflammatory effects. These compounds contribute to the potential health-promoting properties of Indian Mustard including reducing the risk of chronic diseases such as cancer and cardiovascular disorders. In traditional herbal medicine Indian Mustard leaves are valued for their medicinal potential. They are believed to aid digestion and promote gastrointestinal health. Additionally Indian Mustard leaves are consumed as a nutritious vegetable and are often incorporated into various culinary dishes adding flavor and nutritional value. Moreover Indian Mustard oil extracted from the seeds is used both for culinary and medicinal purposes. Rich in monounsaturated and polyunsaturated fats Indian Mustard oil is considered heart-healthy and may help lower cholesterol levels when consumed in moderation. It is also used topically in traditional medicine for massage and skincare purposes thanks to its warming and analgesic properties. Overall Indian Mustard stands as a versatile plant with numerous culinary and medicinal uses. Its cultivation and utilization not only contribute to culinary diversity but also offer potential health benefits making it a valuable component of both diets and traditional medicine practices in India and beyond.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c42f"
  },
  "id_1": 1,
  "class_name_1": "Alpinia Galanga",
  "local_name_1": "Rasna",
  "med_info_1": "Rasna (Alpinia Galanga) ,also known as Galangal or Greater Galangal, is a medicinal herb native to Southeast Asia, particularly found in countries like India, Indonesia, and Thailand. It has been traditionally used in Ayurvedic and traditional Chinese medicine for its numerous health benefits. Rasna possesses anti-inflammatory, analgesic, antioxidant, and antimicrobial properties, making it useful in the treatment of various ailments. One of its primary medical uses is for alleviating pain and inflammation associated with conditions such as arthritis, rheumatism, and muscle sprains. It contains compounds like flavonoids and phenolic acids that help reduce inflammation and provide pain relief. In traditional medicine, rasna is often prepared as a decoction or infusion from its rhizomes or roots. This decoction is used topically as a poultice or applied as an oil for massaging onto affected areas to reduce pain and swelling. Additionally, rasna can be consumed orally in the form of teas or tinctures to relieve internal inflammation and discomfort. Moreover, rasna is recognized for its digestive properties and is used to alleviate gastrointestinal issues such as indigestion, bloating, and nausea. It stimulates digestive enzymes, improves appetite, and aids in the digestion of food. However, it's essential to note that while rasna offers numerous health benefits, excessive consumption may lead to adverse effects. Pregnant women and individuals with underlying health conditions should consult healthcare professionals before using rasna medicinally to ensure its safety and appropriateness for their specific situation.",
  "location_found_1": "India, Indonesia, and Thailand"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c430"
  },
  "id_1": 7,
  "class_name_1": "Carissa Carandas",
  "local_name_1": "Karanda",
  "med_info_1": "Karanda, scientifically known as Carissa carandas, is a shrub species native to the Indian subcontinent, including regions of India. This plant is commonly found in tropical and subtropical climates and is valued for its edible fruits and medicinal properties. The fruits of Karanda are small, round berries that are rich in vitamin C, antioxidants, and various nutrients. They have a tart and slightly sour taste, making them suitable for culinary use in jams, chutneys, and beverages. Additionally, Karanda fruits are utilized in traditional medicine for their numerous health benefits. In traditional herbal medicine practices like Ayurveda, Karanda is esteemed for its medicinal properties. The fruits are believed to possess anti-inflammatory, analgesic, and anti-diabetic properties. They are often used to prepare decoctions, syrups, or extracts that are consumed orally to alleviate various ailments. Karanda fruits are also valued for their digestive properties and are used to treat digestive disorders such as indigestion, bloating, and flatulence. Furthermore, they are believed to strengthen the immune system and promote overall well-being when consumed regularly. Apart from the fruits, other parts of the Karanda plant, such as the leaves, roots, and bark, are also utilized in traditional medicine for their medicinal properties. Extracts from these plant parts are used topically to treat skin conditions, wounds, and infections. In summary, Karanda is a valuable plant species with both culinary and medicinal significance. Its fruits are not only enjoyed for their unique flavor but also utilized for their therapeutic properties in traditional medicine systems. As such, Karanda remains an important component of Indian herbal medicine and cultural heritage.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c431"
  },
  "id_1": 8,
  "class_name_1": "Cirtus Limon",
  "local_name_1": "Lemon",
  "med_info_1": "Lemon, scientifically known as Citrus limon, is a citrus fruit tree native to India. Renowned for its refreshing flavor and acidic taste, lemon is a versatile fruit utilized in culinary, medicinal, and household applications worldwide. Lemons are rich in vitamin C, antioxidants, and various phytochemicals, making them highly beneficial for health. The fruit's acidic nature contributes to its ability to aid digestion, promote hydration, and boost the immune system. Lemon juice is often consumed diluted in water or added to beverages like tea to enhance flavor and provide health benefits. In traditional medicine, lemon is valued for its medicinal properties. Lemon juice is used as a natural remedy for sore throat, cough, and cold symptoms due to its antibacterial and immune-boosting properties. Additionally, lemon peel contains essential oils that are utilized in aromatherapy for their uplifting and mood-enhancing effects. Moreover, lemon juice is a common ingredient in skincare products due to its astringent and antibacterial properties. It is used topically to cleanse and tone the skin, lighten dark spots, and treat acne. Beyond its culinary and medicinal uses, lemon has various household applications. Its acidic juice is employed as a natural cleaner and disinfectant for surfaces, while lemon zest adds flavor to culinary dishes and baked goods. In summary, lemon is a versatile fruit with numerous health, culinary, medicinal, and household applications. Its widespread availability, refreshing taste, and myriad of benefits make it a cherished ingredient in cuisines, traditional medicine systems, and daily life around the world.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c432"
  },
  "id_1": 9,
  "class_name_1": "Ficus Auriculata",
  "local_name_1": "Roxburgh fig",
  "med_info_1": "Roxburgh fig, scientifically known as Ficus auriculata, is a species of fig tree native to various regions of Asia, including India. It is a large, deciduous tree known for its distinctive heart-shaped leaves and small, edible fig-like fruits. In traditional medicine systems such as Ayurveda, various parts of the Roxburgh fig tree are utilized for their medicinal properties. The bark, leaves, and fruits of the tree are believed to possess therapeutic benefits for a range of health conditions. The bark of the Roxburgh fig tree is often used in traditional herbal remedies for its astringent and anti-inflammatory properties. It is commonly employed to treat diarrhea, dysentery, and other gastrointestinal issues. Additionally, the bark extract may be applied externally to wounds and skin conditions for its healing properties. The leaves of the Roxburgh fig tree are also valued for their medicinal potential. They are traditionally used to alleviate pain and inflammation associated with arthritis and other joint disorders. The leaves may be prepared as a poultice or decoction for topical application or consumed orally as a tea. Furthermore, the fruits of the Roxburgh fig tree are edible and are consumed both fresh and dried. They are rich in nutrients, including vitamins, minerals, and dietary fiber. In traditional medicine, the fruits are believed to have cooling properties and are often used to treat fevers and heat-related ailments. Overall, the Roxburgh fig tree holds significance in traditional medicine practices, where its various parts are utilized for their therapeutic properties. While scientific research on its medicinal benefits is limited, the tree remains an important cultural and medicinal resource in regions where it is found.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c433"
  },
  "id_1": 10,
  "class_name_1": "Ficus Relifiosa",
  "local_name_1": "Peepal Tree",
  "med_info_1": "The Peepal tree, scientifically known as Ficus religiosa, holds profound cultural and religious significance in various parts of the world, particularly in India. Revered as a symbol of spirituality and wisdom, this large deciduous tree is often found in temple compounds, sacred groves, and along roadsides. In addition to its cultural and religious importance, the Peepal tree also possesses medicinal properties utilized in traditional medicine systems like Ayurveda. Various parts of the tree, including the leaves, bark, and roots, are esteemed for their therapeutic benefits. The leaves of the Peepal tree are particularly valued for their medicinal properties. They are believed to possess anti-inflammatory, analgesic, and antioxidant properties. In traditional medicine, Peepal leaves are used to treat a variety of ailments, including digestive disorders, respiratory issues, skin conditions, and diabetes. The leaves may be consumed orally as a tea or decoction, or applied topically in the form of poultices or pastes. Furthermore, the bark of the Peepal tree is used in traditional herbal remedies for its astringent and antimicrobial properties. It is commonly employed to treat wounds, ulcers, and other skin infections. The bark extract may be applied externally or used internally as a decoction. Moreover, the roots of the Peepal tree are believed to possess therapeutic properties and are used in traditional medicine to treat conditions such as asthma, cough, and urinary disorders. The root extract may be prepared as a decoction or infusion for oral consumption. While scientific research on the medicinal properties of the Peepal tree is limited, it remains an integral part of traditional medicine practices in many cultures. Its association with spirituality and healing continues to inspire reverence and respect for this ancient and sacred tree.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c434"
  },
  "id_1": 11,
  "class_name_1": "Hibiscus Rosa-sinensis",
  "local_name_1": "Hibiscus",
  "med_info_1": "Hibiscus, scientifically known as Hibiscus rosa-sinensis, is a flowering plant native to tropical regions, including India. Revered for its vibrant and showy flowers, hibiscus holds cultural significance in many parts of the world, where it is often used in ornamental gardening and landscaping. Beyond its aesthetic appeal, hibiscus possesses medicinal properties that have been recognized in traditional medicine systems for centuries. Various parts of the hibiscus plant, including the flowers, leaves, and calyxes, are utilized for their therapeutic benefits. One of the most common uses of hibiscus is in the form of herbal tea. Hibiscus tea, made from the dried calyxes of the flowers, is renowned for its tart flavor and bright red color. It is rich in antioxidants, particularly flavonoids and polyphenols, which contribute to its potential health benefits. In traditional medicine, hibiscus tea is consumed for its medicinal properties, including its ability to lower blood pressure and cholesterol levels, support cardiovascular health, and promote weight loss. Additionally, hibiscus tea is believed to have diuretic properties, aiding in the elimination of excess fluids from the body. Moreover, hibiscus flowers and leaves are used externally in traditional herbal remedies for their skincare benefits. They are believed to possess astringent, anti-inflammatory, and antioxidant properties, making them effective in treating skin conditions such as acne, eczema, and sunburns. Hibiscus extracts are also found in various skincare products, including creams, lotions, and shampoos. While scientific research on the medicinal properties of hibiscus is ongoing, traditional uses of the plant continue to inspire its incorporation into modern herbal medicine and cosmetic formulations. As such, hibiscus remains a beloved and versatile plant with both aesthetic and therapeutic value.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c435"
  },
  "id_1": 12,
  "class_name_1": "Jasminum",
  "local_name_1": "Jasmine",
  "med_info_1": "Jasmine, belonging to the genus Jasminum, encompasses a wide variety of fragrant flowering plants found across India and various parts of the world. Renowned for its exquisite aroma and delicate blossoms, jasmine holds significant cultural, ornamental, and medicinal value. In traditional medicine systems such as Ayurveda and traditional Chinese medicine, jasmine is revered for its therapeutic properties. The flowers, essential oil, and other parts of the jasmine plant are utilized for their medicinal benefits. One of the most well-known uses of jasmine is in aromatherapy. Jasmine essential oil, extracted from the flowers through steam distillation, is prized for its calming and uplifting effects on the mind and emotions. It is often used in aromatherapy blends, massage oils, and perfumes to promote relaxation, reduce stress, and enhance mood. Moreover, jasmine flowers are used in traditional herbal remedies for their medicinal properties. Jasmine tea, made from steeping dried jasmine flowers in hot water, is consumed for its potential health benefits. It is believed to have antioxidant properties, support digestive health, and promote relaxation. In addition to its aromatic and medicinal uses, jasmine is also valued in skincare. Jasmine extracts are commonly found in skincare products such as lotions, creams, and oils for their moisturizing, soothing, and anti-inflammatory properties. Jasmine oil is believed to be beneficial for dry and sensitive skin, helping to hydrate and rejuvenate the complexion. Furthermore, jasmine is cherished for its ornamental value. Its fragrant blossoms adorn gardens, parks, and ceremonial occasions, symbolizing love, purity, and beauty. In many cultures, jasmine flowers are used in garlands, bouquets, and religious ceremonies as offerings to deities or as decorative adornments. In summary, jasmine is a versatile plant with cultural, ornamental, and medicinal significance. Its aromatic flowers and essential oil are cherished for their therapeutic properties, while its ornamental beauty adds charm to gardens and landscapes. Whether enjoyed for its fragrance, consumed for its health benefits, or utilized in skincare, jasmine continues to captivate and inspire people around the world.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603eab795cb446ba7e0c436"
  },
  "id_1": 13,
  "class_name_1": "Mangifera Indica",
  "local_name_1": "Mango",
  "med_info_1": "Mango, scientifically known as Mangifera indica, is a tropical fruit tree native to India and widely cultivated in tropical and subtropical regions around the world. Renowned for its sweet, juicy flesh and distinct flavor, mango holds a special place in culinary traditions, cultural practices, and traditional medicine systems. Mangoes are rich in vitamins, minerals, and antioxidants, making them not only delicious but also nutritious. The fruit is consumed fresh, dried, or processed into various products such as juices, jams, chutneys, and desserts. In addition to its culinary uses, mango is also valued for its medicinal properties. In traditional medicine, mango has been used for centuries to treat a variety of health conditions. Different parts of the mango tree, including the fruit, leaves, bark, and seeds, are utilized for their therapeutic benefits. The fruit itself is believed to have digestive properties and is often consumed to aid digestion and alleviate constipation. Mango leaves are used in traditional herbal remedies for their antidiabetic properties. They are believed to help lower blood sugar levels and regulate insulin secretion, making them beneficial for individuals with diabetes. Furthermore, mango bark and seeds are used in traditional medicine for their antimicrobial and anti-inflammatory properties. Extracts from these parts of the tree are employed to treat various ailments, including infections, inflammation, and fever. Moreover, mangoes are rich in vitamins A and C, which are essential for immune function and overall health. Regular consumption of mangoes may help boost the immune system, protect against infections, and promote overall well-being. In addition to its medicinal properties, mango holds cultural significance in many societies, where it is often associated with prosperity, fertility, and abundance. The fruit features prominently in religious ceremonies, festivals, and culinary traditions, symbolizing auspiciousness and celebration. Overall, mango is not only a beloved fruit but also a valuable resource with diverse culinary and medicinal uses. Its nutritional value, delicious flavor, and cultural significance continue to make it a cherished fruit in tropical regions and beyond.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603f31d95cb446ba7e0c437"
  },
  "id_1": 14,
  "class_name_1": "Mentha",
  "local_name_1": "Mint",
  "med_info_1": "Mint, belonging to the genus Mentha, encompasses a diverse group of aromatic perennial herbs found worldwide, including in India. Renowned for its refreshing flavor and cooling sensation, mint has been valued for centuries for its culinary, medicinal, and aromatic properties. In traditional medicine systems such as Ayurveda and traditional Chinese medicine, mint is esteemed for its therapeutic benefits. Various species of mint, including peppermint (Mentha × piperita) and spearmint (Mentha spicata), are utilized for their medicinal properties. One of the most well-known uses of mint is in herbal teas and infusions. Mint tea, made from steeping fresh or dried mint leaves in hot water, is consumed for its potential health benefits. It is believed to aid digestion, alleviate nausea, and promote relaxation. Additionally, mint tea is often used as a natural remedy for headaches and respiratory conditions due to its analgesic and decongestant properties. Moreover, mint leaves are used in traditional herbal remedies for their digestive and carminative properties. They are often consumed fresh or dried and incorporated into culinary dishes, beverages, and medicinal preparations. Mint leaves are believed to help relieve gas, bloating, indigestion, and stomach cramps. In addition to its internal uses, mint is also valued for its topical applications. Mint essential oil, extracted from the leaves through steam distillation, is used in aromatherapy, massage oils, and skincare products for its cooling, analgesic, and antiseptic properties. It is believed to soothe sore muscles, alleviate tension headaches, and relieve skin irritation. Furthermore, mint is commonly used as a culinary herb to add flavor and aroma to a wide range of dishes, including salads, soups, sauces, desserts, and beverages. Its refreshing taste and fragrance make it a versatile ingredient in both sweet and savory recipes. In summary, mint is a versatile herb with culinary, medicinal, and aromatic uses. Whether enjoyed in teas, culinary dishes, or skincare products, mint continues to be cherished for its refreshing flavor, therapeutic properties, and cultural significance in various parts of the world.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603f31d95cb446ba7e0c438"
  },
  "id_1": 15,
  "class_name_1": "Moringa Oleifera",
  "local_name_1": "Drumstick",
  "med_info_1": "Drumstick, scientifically known as Moringa oleifera, is a fast-growing, drought-resistant tree native to the southern foothills of the Himalayas in India. Also referred to as the miracle tree or tree of life, drumstick is revered for its nutritional, medicinal, and environmental benefits. One of the most notable features of drumstick is its nutritional richness. The leaves, pods, seeds, and flowers of the drumstick tree are all edible and packed with essential vitamins, minerals, and antioxidants. Drumstick leaves, in particular, are a potent source of vitamin C, vitamin A, calcium, iron, and protein, making them a valuable addition to diets, especially in regions where malnutrition is prevalent. In traditional medicine systems like Ayurveda, drumstick has been used for centuries to treat various ailments and promote overall well-being. The plant is believed to possess anti-inflammatory, antimicrobial, antidiabetic, and hepatoprotective properties. Drumstick leaves and pods are utilized in traditional herbal remedies for their medicinal benefits. They are believed to help regulate blood sugar levels, improve digestion, boost immunity, and promote cardiovascular health. Drumstick seed extract is also studied for its potential to purify water and remove impurities, making it a valuable tool in addressing waterborne diseases in communities with limited access to clean water. Moreover, drumstick is valued for its culinary uses. The tender pods, known as drumsticks, are commonly used in Indian cuisine to prepare curries, soups, stews, and side dishes. Drumstick leaves are also used as a nutritious green vegetable in various culinary preparations. Additionally, drumstick oil, extracted from the seeds, is used in skincare and cosmetic products for its moisturizing and anti-aging properties. It is believed to nourish the skin, promote hair growth, and protect against environmental damage. In summary, drumstick is a versatile and beneficial plant with nutritional, medicinal, and environmental significance. Its various parts are utilized for their health-promoting properties, culinary uses, and environmental applications, making drumstick a valuable resource for promoting health, well-being, and sustainability.",
  "location_found_1": "Himalayas in India"
},
{
  "_id": {
    "$oid": "6603f31d95cb446ba7e0c439"
  },
  "id_1": 16,
  "class_name_1": "Muntingia Calabura",
  "local_name_1": "Jamaica Cherry-Gasagase",
  "med_info_1": "Jamaica Cherry, scientifically known as Muntingia calabura, is a fast-growing flowering tree native to tropical regions, including India. Also known as the Strawberry Tree, Calabura, or Gasagase, this tree is valued for its small, cherry-like fruits and medicinal properties. The fruits of the Jamaica Cherry tree are small, red, and resemble cherries, although they are not closely related botanically. They have a sweet and mildly tart flavor, making them popular for fresh consumption, jams, jellies, and beverages. In traditional medicine, various parts of the Jamaica Cherry tree are utilized for their medicinal benefits. The leaves, bark, and fruits are believed to possess therapeutic properties and have been used to treat a variety of ailments. The leaves of the Jamaica Cherry tree are commonly used in traditional herbal remedies for their potential health benefits. They are believed to have anti-inflammatory, antioxidant, and antimicrobial properties. Leaf extracts are often used to prepare decoctions, infusions, or poultices for treating wounds, skin infections, and inflammation. Moreover, the bark of the Jamaica Cherry tree is valued for its astringent properties. It is used in traditional medicine to treat diarrhea, dysentery, and other gastrointestinal issues. The bark extract may be consumed orally or applied externally as a remedy for digestive disorders. Additionally, Jamaica Cherry fruits are rich in vitamin C and other antioxidants, which contribute to their potential health benefits. They are believed to boost the immune system, promote cardiovascular health, and support overall well-being when consumed regularly. While scientific research on the medicinal properties of Jamaica Cherry is limited, it remains an important component of traditional medicine practices in many regions. Its delicious fruits and potential health benefits make it a cherished tree in tropical landscapes and a valuable resource for promoting health and well-being.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603f31d95cb446ba7e0c43a"
  },
  "id_1": 17,
  "class_name_1": "Murraya koenigii",
  "local_name_1": "Curry",
  "med_info_1": "Curry, scientifically known as Murraya koenigii, is a small tropical tree native to India. It is renowned for its aromatic leaves, which are a staple ingredient in Indian cuisine and are commonly referred to as curry leaves. Despite its name, curry leaves are not directly related to the spice blend known as curry powder. Instead, they impart a distinctive flavor and aroma to dishes, contributing to the characteristic taste of many Indian curries, soups, stews, and chutneys. In addition to their culinary uses, curry leaves also possess medicinal properties that have been recognized in traditional medicine systems such as Ayurveda. The leaves are valued for their antioxidant, anti-inflammatory, antimicrobial, and digestive properties. In traditional herbal medicine, curry leaves are used to treat various ailments, including indigestion, diarrhea, nausea, and stomach ulcers. They are believed to stimulate digestive enzymes, improve digestion, and alleviate gastrointestinal discomfort. Moreover, curry leaves are rich in vitamins, minerals, and phytochemicals, which contribute to their potential health benefits. They are particularly high in vitamin A, vitamin C, calcium, and iron, making them beneficial for overall health and well-being. Furthermore, curry leaves are used externally in traditional medicine for their skincare benefits. They are believed to have antimicrobial and anti-inflammatory properties, making them effective in treating skin conditions such as acne, eczema, and psoriasis. Curry leaf extract is also found in various skincare products, including creams, lotions, and oils. While scientific research on the medicinal properties of curry leaves is ongoing, their widespread use in traditional medicine and culinary traditions underscores their importance in Indian culture and cuisine. Whether used to enhance the flavor of dishes or promote health and well-being, curry leaves remain a cherished and versatile ingredient in Indian culinary and medicinal practices.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603f31d95cb446ba7e0c43b"
  },
  "id_1": 18,
  "class_name_1": "Nerium Oleander",
  "local_name_1": "Oleander",
  "med_info_1": "Oleander, scientifically known as Nerium oleander, is a flowering shrub native to India and other Mediterranean regions. Despite its attractive appearance and colorful blooms, oleander contains toxic compounds that can be harmful if ingested or inhaled. While oleander is primarily grown for ornamental purposes, it has a history of use in traditional medicine, albeit cautiously due to its toxicity. Certain parts of the oleander plant, including the leaves, flowers, and stems, contain cardiac glycosides, which can affect the heart and nervous system. In traditional herbal medicine, oleander has been used in small, controlled doses to treat various ailments such as heart conditions, asthma, epilepsy, and malaria. However, due to the plant's toxicity, the use of oleander in herbal remedies is controversial and generally discouraged. It's important to note that ingesting any part of the oleander plant, whether fresh or dried, can lead to severe poisoning and even death. Symptoms of oleander poisoning may include nausea, vomiting, abdominal pain, irregular heart rhythm, seizures, and coma. Immediate medical attention is required if oleander poisoning is suspected. Despite its toxicity, oleander continues to be cultivated for its ornamental beauty in gardens, parks, and landscapes. However, precautions should be taken to prevent accidental ingestion, especially in households with children and pets. In summary, while oleander has a history of traditional medicinal use, its toxicity limits its therapeutic potential and poses significant health risks. Caution should be exercised when handling or cultivating oleander, and its use in herbal medicine should be avoided due to the potential for severe poisoning.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603f31d95cb446ba7e0c43c"
  },
  "id_1": 19,
  "class_name_1": "Nyctanthes Arbor-trists",
  "local_name_1": "Parijata",
  "med_info_1": "Parijata, scientifically known as Nyctanthes arbor-tristis, is a small, flowering tree native to India. Also known as the Night-flowering Jasmine or Harsingar, this plant holds significant cultural, religious, and medicinal importance in Indian traditions. The Parijata tree is revered for its fragrant, white flowers that bloom at night and are often associated with various Hindu myths and legends. The flowers are used in religious rituals, festivals, and offerings to deities, symbolizing beauty, purity, and divinity. In addition to its cultural significance, Parijata is valued for its medicinal properties in traditional medicine systems like Ayurveda. Various parts of the plant, including the flowers, leaves, bark, and seeds, are utilized for their therapeutic benefits. The flowers of Parijata are believed to possess anti-inflammatory, analgesic, and antimicrobial properties. They are used in traditional herbal remedies to treat a range of ailments, including fever, arthritis, joint pain, and skin conditions. Parijata flower extracts are often prepared as decoctions, infusions, or oils for internal and external use. Moreover, Parijata leaves are esteemed for their medicinal properties. They are used in traditional medicine to alleviate digestive issues, such as indigestion, bloating, and constipation. The leaves may be consumed orally or applied topically as poultices or pastes for their therapeutic effects. Furthermore, Parijata bark and seeds are utilized in traditional herbal remedies for their potential health benefits. Bark extracts are believed to have astringent properties and are used to treat diarrhea, dysentery, and other gastrointestinal disorders. Seeds are used for their purgative and anthelmintic properties, helping to expel intestinal parasites. While scientific research on the medicinal properties of Parijata is limited, its long history of use in traditional medicine and cultural significance underscores its importance in Indian culture and wellness practices. Whether used in religious ceremonies or as a natural remedy for various ailments, Parijata remains a cherished and valuable plant in Indian traditions.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6603f31d95cb446ba7e0c43d"
  },
  "id_1": 20,
  "class_name_1": "Ocimum Tenuiflorum",
  "local_name_1": "Tulsi",
  "med_info_1": "Tulsi, scientifically known as Ocimum tenuiflorum, is a sacred herb native to India and revered for its medicinal, culinary, and spiritual significance. Also known as Holy Basil, tulsi is a member of the mint family and is highly esteemed in Ayurvedic medicine for its therapeutic properties. Tulsi is renowned for its adaptogenic properties, meaning it helps the body adapt to stress and promote balance. It is considered an 'elixir of life' in Ayurveda and is believed to promote longevity and vitality. Tulsi is rich in antioxidants, including flavonoids and phenolic compounds, which contribute to its potential health benefits. In traditional medicine, tulsi is used to treat a wide range of ailments. It is believed to have anti-inflammatory, antimicrobial, and immunomodulatory properties, making it beneficial for respiratory infections, allergies, and inflammatory conditions. Tulsi leaves are often consumed fresh, dried, or as a tea to support respiratory health, boost immunity, and relieve coughs, colds, and flu symptoms. Moreover, tulsi is valued for its adaptogenic properties, which help alleviate stress, anxiety, and mental fatigue. It is often used in Ayurvedic formulations to support cognitive function, improve focus, and promote emotional well-being. Furthermore, tulsi is used in culinary applications to add flavor and aroma to dishes. It is a key ingredient in various Indian cuisines, including curries, soups, chutneys, and beverages. The leaves, flowers, and seeds of tulsi are all utilized in culinary preparations, providing both flavor and nutritional benefits. Additionally, tulsi holds spiritual significance in Hinduism and is considered a sacred plant dedicated to Lord Vishnu and Goddess Lakshmi. It is often planted near temples and homes and used in religious rituals, ceremonies, and prayers. In summary, tulsi is a versatile herb with numerous health, culinary, and spiritual benefits. Its rich history in traditional medicine, culinary traditions, and religious practices underscores its importance in Indian culture and its continued popularity worldwide for promoting health and well-being.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a11e"
  },
  "id_1": 21,
  "class_name_1": "Piper Betle",
  "local_name_1": "Betel",
  "med_info_1": "Betel, scientifically known as Piper betle, is a perennial vine native to India and widely cultivated in Southeast Asia. It is a member of the Piperaceae family and is renowned for its heart-shaped leaves, which are commonly used in traditional practices such as betel chewing. Betel leaves have a long history of cultural, medicinal, and ceremonial significance in various parts of Asia. They are often chewed with areca nut and slaked lime, sometimes combined with other ingredients like tobacco or spices, in a preparation known as \"paan.\" In traditional medicine, betel leaves are believed to possess various therapeutic properties. They are considered carminative, stimulant, and antiseptic. Betel leaf extracts are used in herbal remedies to treat digestive issues, respiratory conditions, oral health problems, and skin ailments. Betel leaves are valued for their ability to stimulate saliva production and aid digestion. They are often chewed after meals to freshen the breath, improve appetite, and promote gastrointestinal health. Betel leaf extracts are also used topically to treat skin conditions such as wounds, infections, and inflammation. Moreover, betel leaves contain phytochemicals such as phenols, tannins, and flavonoids, which contribute to their potential health benefits. These compounds exhibit antioxidant, antimicrobial, and anti-inflammatory properties, making betel leaves a valuable resource in traditional medicine systems. In addition to its medicinal uses, betel leaves play a significant role in cultural and ceremonial practices. They are offered as a symbol of hospitality, respect, and goodwill in social gatherings, religious ceremonies, and festivals. Betel chewing is considered a traditional custom and cultural tradition in many communities. However, it's important to note that excessive betel chewing, particularly when combined with areca nut and tobacco, can have adverse health effects. Prolonged use of betel can lead to oral health issues such as staining, gum disease, and oral cancer. Therefore, moderation is key when consuming betel preparations for both medicinal and cultural purposes. In summary, betel is a versatile plant with cultural, medicinal, and ceremonial significance. While betel leaves have been used for centuries in traditional medicine and cultural practices, it's essential to be aware of the potential health risks associated with excessive consumption and to use them mindfully and in moderation.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a11f"
  },
  "id_1": 22,
  "class_name_1": "Plectranthus Amboinicus",
  "local_name_1": "Mexican Mint",
  "med_info_1": "Mexican Mint, scientifically known as Plectranthus amboinicus, is a succulent herb native to tropical regions, including India. Also known as Cuban oregano, Spanish thyme, or Indian borage, Mexican Mint is valued for its culinary, medicinal, and ornamental properties. In traditional medicine systems such as Ayurveda and traditional Chinese medicine, Mexican Mint has been used for its various medicinal benefits. The leaves of the Mexican Mint plant are rich in essential oils, flavonoids, and other bioactive compounds, which contribute to its potential health-promoting properties. One of the primary uses of Mexican Mint is in culinary applications. The leaves have a strong, aromatic flavor reminiscent of oregano and thyme, making them a popular ingredient in various cuisines, including Indian, Caribbean, and Latin American. Mexican Mint leaves are used to flavor soups, stews, curries, sauces, and meat dishes, adding depth and complexity to culinary creations. Moreover, Mexican Mint is valued for its medicinal properties. The leaves are believed to have antibacterial, antifungal, anti-inflammatory, and antioxidant properties, making them beneficial for treating a variety of health conditions. In traditional herbal medicine, Mexican Mint leaves are used to alleviate respiratory issues such as coughs, colds, and bronchitis. They are also believed to aid digestion, relieve gastrointestinal discomfort, and promote appetite. Furthermore, Mexican Mint leaves are used externally in traditional medicine to treat skin conditions such as wounds, insect bites, and skin infections. The leaves may be crushed and applied topically as a poultice or infused into oils and ointments for skin care purposes. Additionally, Mexican Mint is cultivated for its ornamental value. Its attractive foliage and aromatic leaves make it a popular choice for herb gardens, container gardens, and ornamental borders. In summary, Mexican Mint is a versatile herb with culinary, medicinal, and ornamental uses. Its aromatic leaves and potential health benefits make it a valuable addition to culinary dishes and herbal medicine preparations, while its ornamental value adds beauty and fragrance to gardens and landscapes.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a120"
  },
  "id_1": 23,
  "class_name_1": "Pongamia Pinnata",
  "local_name_1": "Indian Beech",
  "med_info_1": "Indian Beech, scientifically known as Pongamia pinnata, is a medium-sized tree native to India and other parts of Asia. Also known as the Pongam Tree or Karanj, Indian Beech is valued for its various ecological, medicinal, and industrial uses. Indian Beech trees are known for their hardy nature and ability to thrive in diverse environmental conditions. They are often cultivated for reforestation, soil conservation, and landscaping purposes. The tree's dense foliage provides shade and shelter to various wildlife species and helps prevent soil erosion. In traditional medicine systems such as Ayurveda and Siddha, Indian Beech has been used for its medicinal properties. The seeds, leaves, bark, and oil extracted from the seeds are all utilized for their therapeutic benefits. One of the primary medicinal uses of Indian Beech is in the treatment of skin disorders. The oil extracted from the seeds, known as Pongam oil or Karanja oil, is rich in bioactive compounds such as pongamol and karanjin, which possess antibacterial, antifungal, anti-inflammatory, and wound-healing properties. Pongam oil is commonly used topically to treat conditions such as eczema, psoriasis, acne, and dermatitis. Moreover, Indian Beech seeds are used internally in traditional herbal remedies for their potential health benefits. They are believed to have antipyretic, analgesic, anti-inflammatory, and antidiabetic properties. Indian Beech seed extracts are used to treat fever, pain, inflammation, diabetes, and other ailments. Furthermore, Indian Beech leaves and bark are used in traditional medicine for their astringent and antiseptic properties. They are used externally to treat wounds, cuts, bruises, and skin infections. Additionally, Indian Beech is valued for its industrial uses. The seeds contain oil, which can be extracted and processed into biodiesel, a renewable and environmentally friendly alternative to fossil fuels. Pongam oil is also used in the production of soaps, cosmetics, lubricants, and insecticides. In summary, Indian Beech is a multipurpose tree with ecological, medicinal, and industrial significance. Its various parts are utilized for their therapeutic properties in traditional medicine, while its seeds are valuable for biodiesel production and other industrial applications. Indian Beech plays an important role in sustainable development, environmental conservation, and traditional healthcare practices in India and beyond.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a121"
  },
  "id_1": 24,
  "class_name_1": "Psidium Guajava",
  "local_name_1": "Guava",
  "med_info_1": "Guava, scientifically known as Psidium guajava, is a tropical fruit tree native to India and widely cultivated in tropical and subtropical regions around the world. Renowned for its delicious fruit and medicinal properties, guava holds a special place in culinary traditions, cultural practices, and traditional medicine systems. Guava fruits are round or pear-shaped with a green or yellow skin and sweet, aromatic flesh containing numerous small seeds. They are rich in essential nutrients, including vitamin C, vitamin A, potassium, fiber, and antioxidants such as flavonoids and polyphenols. In traditional medicine, various parts of the guava tree, including the fruit, leaves, bark, and roots, are utilized for their medicinal benefits. Guava leaves, in particular, are valued for their therapeutic properties and have been used for centuries in herbal remedies. Guava leaves are believed to have antimicrobial, anti-inflammatory, and antioxidant properties. They are used in traditional herbal medicine to treat a variety of ailments, including gastrointestinal issues, respiratory conditions, skin disorders, and oral health problems. One of the primary uses of guava leaves is in promoting digestive health. They are believed to aid digestion, alleviate diarrhea, and prevent stomach ulcers. Guava leaf tea is commonly consumed for its potential digestive benefits and is also used topically to treat wounds, cuts, and skin infections. Moreover, guava leaves are valued for their potential to regulate blood sugar levels. Research suggests that compounds found in guava leaves may help lower blood glucose levels and improve insulin sensitivity, making them beneficial for individuals with diabetes or at risk of developing diabetes. Furthermore, guava fruits are consumed fresh or processed into various products such as juices, jams, jellies, and desserts. They are prized for their sweet flavor, refreshing taste, and nutritional value. Guava fruits are also rich in dietary fiber, which supports digestive health, promotes satiety, and helps regulate blood sugar and cholesterol levels. In summary, guava is a versatile fruit tree with culinary, medicinal, and nutritional benefits. Its fruits are enjoyed for their delicious flavor and nutritional richness, while its leaves are valued for their therapeutic properties in traditional medicine. Guava plays an important role in promoting health and well-being and is cherished in tropical regions and beyond for its many uses.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a122"
  },
  "id_1": 25,
  "class_name_1": "Punica Granatum",
  "local_name_1": "Pomegranate",
  "med_info_1": "Pomegranate, scientifically known as Punica granatum, is a fruit-bearing shrub or small tree native to the region encompassing Iran to northern India. Revered for its unique appearance, delicious flavor, and medicinal properties, pomegranate has been cultivated for centuries in various parts of the world. The fruit of the pomegranate is a spherical berry with a thick, leathery skin ranging in color from red to yellow. Inside, the fruit contains numerous arils, each surrounding a seed encased in juicy, translucent pulp. Pomegranate arils are prized for their sweet-tart flavor and are enjoyed fresh, juiced, or as a flavorful addition to various culinary dishes and beverages. Beyond its culinary uses, pomegranate has a long history of use in traditional medicine systems such as Ayurveda and traditional Chinese medicine. The fruit, seeds, peel, and juice of the pomegranate are all utilized for their medicinal properties. Pomegranate is rich in bioactive compounds, including antioxidants such as flavonoids, phenolic acids, and punicalagins, which contribute to its potential health benefits. These compounds have been linked to various health-promoting effects, including anti-inflammatory, antioxidant, anticancer, and cardioprotective properties. In traditional herbal medicine, pomegranate has been used to treat a variety of ailments, including digestive disorders, cardiovascular issues, bacterial and viral infections, and inflammatory conditions. Pomegranate juice or extract is believed to promote cardiovascular health by reducing cholesterol levels, lowering blood pressure, and improving blood flow. Moreover, pomegranate is valued for its potential to support immune function, protect against oxidative stress, and promote skin health. Pomegranate seed oil, extracted from the seeds, is rich in fatty acids and is used topically in skincare products for its moisturizing, anti-aging, and anti-inflammatory properties. Additionally, pomegranate has cultural and symbolic significance in various cultures and religions. It is often associated with fertility, abundance, and prosperity and is used in religious rituals, ceremonies, and celebrations. In summary, pomegranate is a versatile fruit with culinary, medicinal, and cultural significance. Its delicious taste, nutritional richness, and potential health benefits make it a valuable addition to diets and traditional medicine practices worldwide. Pomegranate continues to be cherished and celebrated for its many uses, both ancient and modern.",
  "location_found_1": "Iran"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a123"
  },
  "id_1": 26,
  "class_name_1": "Santalum Album",
  "local_name_1": "Sandalwood",
  "med_info_1": "Sandalwood, scientifically known as Santalum album, is a small evergreen tree native to the Indian subcontinent, particularly India. It is renowned for its aromatic wood, which has been prized for centuries for its distinctive fragrance, medicinal properties, and various other uses. The heartwood of the sandalwood tree is highly valued for its fragrant aroma and is used in the production of incense, perfumes, cosmetics, and traditional medicines. Sandalwood oil, extracted from the wood through steam distillation, is prized for its rich, sweet, and woody scent, making it a sought-after ingredient in the fragrance industry. In traditional medicine systems such as Ayurveda, sandalwood has been used for its medicinal properties. Sandalwood oil and paste are believed to possess anti-inflammatory, antimicrobial, antiseptic, and astringent properties, making them beneficial for skin health and overall well-being. Sandalwood paste, made by grinding the wood into a fine powder and mixing it with water or other liquid mediums, is applied topically to the skin to soothe irritation, reduce inflammation, and promote healing. It is used to treat various skin conditions, including acne, eczema, rashes, and sunburns. Sandalwood paste is also valued for its cooling and moisturizing effects on the skin. Moreover, sandalwood oil is used in aromatherapy for its calming and relaxing properties. It is believed to reduce stress, anxiety, and nervous tension when used in diffusers, massage oils, bath blends, and skincare products. Sandalwood oil is also used in traditional medicine for its potential to alleviate headaches, insomnia, and respiratory issues when inhaled or applied topically. Additionally, sandalwood has cultural and religious significance in many societies. It is often used in religious rituals, ceremonies, and spiritual practices as incense or as an offering to deities. Sandalwood beads are also used in prayer beads (malas) and as a symbol of meditation and devotion. In summary, sandalwood is a valuable tree with aromatic, medicinal, and cultural significance. Its fragrant wood, oil, and paste have been cherished for centuries for their therapeutic properties and are used in various applications, from skincare to spiritual practices. Sandalwood continues to be revered and celebrated for its many uses, both ancient and modern.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a124"
  },
  "id_1": 27,
  "class_name_1": "Syzygium Cumini",
  "local_name_1": "Jamun",
  "med_info_1": "Jamun, scientifically known as Syzygium cumini, is a tropical evergreen tree native to India and other parts of Southeast Asia. Also known as Java Plum, Indian Blackberry, or Eugenia jambolana, Jamun is renowned for its delicious, purplish-black berries and medicinal properties. The fruit of the Jamun tree is small, round, and varies in color from dark purple to black when ripe. It has a unique sweet and tangy flavor, making it popular for fresh consumption, juices, jams, jellies, and desserts. Jamun fruit is rich in nutrients, including vitamins, minerals, antioxidants, and dietary fiber. In traditional medicine systems such as Ayurveda, Jamun has been used for its various health benefits. The fruit, seeds, bark, and leaves of the Jamun tree are all utilized for their medicinal properties. Jamun fruit is valued for its potential to regulate blood sugar levels. It contains bioactive compounds such as jamboline, which may help improve insulin sensitivity and reduce blood glucose levels, making it beneficial for individuals with diabetes or at risk of developing diabetes. Moreover, Jamun fruit is rich in antioxidants, including anthocyanins and polyphenols, which contribute to its potential health-promoting effects. These antioxidants help neutralize free radicals, reduce inflammation, and protect cells from oxidative damage, thereby promoting overall health and well-being. Additionally, various parts of the Jamun tree are used in traditional herbal remedies. Jamun seeds are believed to possess anti-inflammatory, antimicrobial, and antidiarrheal properties and are used to treat gastrointestinal issues, skin infections, and oral health problems. Furthermore, Jamun leaves and bark are valued for their astringent and antimicrobial properties. They are used topically to treat wounds, cuts, and skin infections and are also used internally to alleviate diarrhea, dysentery, and other gastrointestinal ailments. In summary, Jamun is a versatile tree with culinary, medicinal, and nutritional significance. Its delicious fruit, along with its various parts, is used in traditional medicine for its potential health benefits, including blood sugar regulation, antioxidant support, and gastrointestinal health. Jamun continues to be cherished and utilized in traditional practices and modern applications for promoting health and well-being.",
  "location_found_1": "India and other parts of Southeast Asia"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a125"
  },
  "id_1": 28,
  "class_name_1": "Syzygium Jambos",
  "local_name_1": "Rose Apple",
  "med_info_1": "Rose Apple, scientifically known as Syzygium jambos, is a tropical fruit tree native to India and Southeast Asia. Also known as Jambu, Wax Apple, or Bell Fruit, Rose Apple is prized for its crisp, watery flesh and delicate floral aroma, resembling the scent of rose petals. The fruit of the Rose Apple tree is typically bell-shaped or pear-shaped, with a thin, waxy skin that ranges in color from green to pink or red when ripe. The flesh is juicy and mildly sweet, often eaten fresh or used in fruit salads, desserts, juices, and jams. In addition to its culinary uses, Rose Apple has a history of use in traditional medicine systems for its potential health benefits. The fruit, leaves, bark, and seeds of the Rose Apple tree are all utilized for their medicinal properties. Rose Apple fruit is rich in vitamins, minerals, and antioxidants, including vitamin C, vitamin A, potassium, and dietary fiber. It is believed to support digestive health, promote hydration, and boost immunity when consumed regularly as part of a balanced diet. Moreover, Rose Apple leaves are used in traditional herbal remedies for their astringent and anti-inflammatory properties. They are believed to have antimicrobial and antidiarrheal effects and are used to treat gastrointestinal issues such as diarrhea, dysentery, and stomach ulcers. Furthermore, Rose Apple bark and seeds are also utilized in traditional medicine for their potential health benefits. Extracts from the bark and seeds are believed to possess antioxidant and antimicrobial properties and are used in herbal preparations to treat various ailments, including skin infections, inflammation, and respiratory conditions. Additionally, Rose Apple is valued for its ornamental qualities. The tree produces fragrant flowers with creamy-white petals and prominent stamens, adding beauty and fragrance to gardens and landscapes. In summary, Rose Apple is a versatile fruit tree with culinary, medicinal, and ornamental uses. Its delicious fruit, aromatic flowers, and potential health benefits make it a valuable resource in tropical regions and beyond. Rose Apple continues to be cherished and celebrated for its many uses, both ancient and modern.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a126"
  },
  "id_1": 29,
  "class_name_1": "Tabernaemontana Divaricata",
  "local_name_1": "Crape Jasmine",
  "med_info_1": "Crape Jasmine, scientifically known as Tabernaemontana divaricata, is a flowering shrub native to India and other parts of Southeast Asia. Also known as pinwheel flower, East India rosebay, or Nandiarvattam, Crape Jasmine is prized for its fragrant white flowers and ornamental foliage. The flowers of Crape Jasmine are star-shaped with waxy petals arranged in a pinwheel-like fashion, giving them a distinctive appearance and a pleasant fragrance. They bloom profusely throughout the year, making Crape Jasmine a popular choice for gardens, landscapes, and decorative borders. In addition to its ornamental value, Crape Jasmine has a history of use in traditional medicine for its potential medicinal properties. Various parts of the plant, including the leaves, bark, roots, and flowers, are utilized in herbal remedies. Crape Jasmine is believed to possess several therapeutic properties, including anti-inflammatory, analgesic, antipyretic, and antioxidant effects. In traditional medicine systems such as Ayurveda and Siddha, Crape Jasmine extracts are used to treat various ailments, including fever, pain, inflammation, and skin disorders. The leaves of Crape Jasmine are often used externally to soothe skin irritations, insect bites, and minor wounds. They are crushed and applied topically as poultices or infused into oils for use in skincare preparations. Moreover, Crape Jasmine is valued for its potential to promote relaxation and reduce stress. The fragrance of its flowers is often used in aromatherapy to induce a sense of calmness, improve mood, and alleviate anxiety. Additionally, Crape Jasmine holds cultural and symbolic significance in various societies. It is often associated with purity, beauty, and spirituality and is used in religious rituals, ceremonies, and festive decorations. In summary, Crape Jasmine is a versatile plant with ornamental, medicinal, and cultural significance. Its beautiful flowers, fragrant aroma, and potential health benefits make it a cherished and valued species in tropical gardens and traditional medicine practices. Crape Jasmine continues to be admired and appreciated for its many uses, both aesthetic and therapeutic.",
  "location_found_1": "India"
},
{
  "_id": {
    "$oid": "6604588cc0b3bd384578a127"
  },
  "id_1": 30,
  "class_name_1": "Trigonella Fornum-graecum",
  "local_name_1": "Fenugreek",
  "med_info_1": "Fenugreek, scientifically known as Trigonella foenum-graecum, is an annual herb native to the Mediterranean region, including Greece and India. It is widely cultivated for its aromatic seeds and leaves, which are used as a spice, herb, and traditional medicine ingredient. Fenugreek seeds are small, golden-brown, and possess a distinctively bitter flavor with a hint of sweetness. They are commonly used as a spice in Indian, Middle Eastern, and Mediterranean cuisines, imparting a unique taste to dishes such as curries, stews, bread, and pickles. Fenugreek seeds are also ground into a fine powder and used as a flavoring agent in spice blends and curry pastes. In addition to its culinary uses, fenugreek has a long history of use in traditional medicine systems such as Ayurveda, Traditional Chinese Medicine (TCM), and traditional Greek medicine. The seeds, leaves, and roots of the fenugreek plant are all utilized for their medicinal properties. Fenugreek seeds are rich in bioactive compounds, including alkaloids, flavonoids, saponins, and steroidal sapogenins, which contribute to their potential health benefits. These compounds have been studied for their various pharmacological effects, including anti-inflammatory, antioxidant, hypoglycemic, and hypolipidemic properties. In traditional herbal medicine, fenugreek seeds are used to support digestive health, regulate blood sugar levels, improve lactation in nursing mothers, and enhance libido and sexual health. Fenugreek seed extracts are also used topically to soothe skin irritation, inflammation, and wounds. Moreover, fenugreek leaves, known as methi in Hindi, are used as a culinary herb and medicinal ingredient. They are rich in vitamins, minerals, and phytonutrients, including vitamin C, vitamin K, iron, calcium, and antioxidants. Fenugreek leaves are commonly used in Indian cuisine to flavor dishes such as curries, dals, and vegetable stir-fries, as well as in traditional herbal remedies for their potential health benefits. Furthermore, fenugreek roots are used in traditional medicine for their diuretic and expectorant properties. They are believed to promote urinary tract health, relieve respiratory congestion, and support overall well-being. In summary, fenugreek is a versatile herb with culinary, medicinal, and nutritional benefits. Its seeds, leaves, and roots are valued for their distinct flavor, aromatic aroma, and potential health-promoting properties, making fenugreek a cherished and essential ingredient in cuisines and traditional medicine practices around the world.",
  "location_found_1": "Greece and India"
}]